liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC39B/0_Src/AppSw/Tricore/DemoMcal/Demo_Irq/Traps/Traps.c
/*******************************************************************************
**                                                                            **
** Copyright (C) Infineon Technologies (2018)                                 **
**                                                                            **
** All rights reserved.                                                       **
**                                                                            **
** This document contains proprietary information belonging to Infineon       **
** Technologies. Passing on and copying of this document, and communication   **
** of its contents is not permitted without prior written authorization.      **
**                                                                            **
********************************************************************************
**                                                                            **
**  FILENAME     : Traps.c                                                    **
**                                                                            **
**  VERSION      : 1.0.0                                                      **
**                                                                            **
**  DATE         : 2018-02-02                                                 **
**                                                                            **
**  VARIANT      : NA                                                         **
**                                                                            **
**  PLATFORM     : Infineon AURIX2G                                           **
**                                                                            **
**  AUTHOR       : DL-AUTOSAR-Engineering                                     **
**                                                                            **
**  VENDOR       : Infineon Technologies                                      **
**                                                                            **
**  DESCRIPTION  : Trap handler functions source file                         **
**                                                                            **
**  MAY BE CHANGED BY USER [yes/no]: Yes                                      **
**                                                                            **
*******************************************************************************/

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
#include "Std_Types.h"
#include "IfxScu_reg.h"
#include "IfxCpu_reg.h"
#include "Test_Print.h"
#include "IFX_Os.h"
#include "Traps.h"
/*******************************************************************************
**                      Imported Compiler Switch Check                        **
*******************************************************************************/

uint8 Trap_Status;

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/

#define CPU_SPINLOCK_TIMEOUT_TRAP   (0xFFFFFFU)

#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1U)
#define DEBUG()  __debug()
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#endif

#ifdef _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
#define DEBUG() __asm__ volatile ("debug")
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#endif

#ifdef _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
#define DEBUG() __debug()
#define __debug _debug
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
#ifdef _GHS_C_TRICORE_
#if (_GHS_C_TRICORE_ == 1U)
#define DEBUG() __debug()
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#endif

/*******************************************************************************
**                      Private Variable Definitions                          **
*******************************************************************************/
/*******************************************************************************
**                      Private Type Definitions                              **
*******************************************************************************/

/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/
void _trap_0( void );
void _trap_1( void );
void _trap_2( void );
void _trap_3( void );
void _trap_4( void );
void _trap_5( void );
void _trap_6( void );
void _trap_7( void );
/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/
/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/
volatile uint32 SFR_Return_Value;
volatile uint32 SV_Return_Value;
static uint32 UVALCON0;
static volatile uint32 TrapIdentification[8][8];
volatile uint32 Trap_lock;
/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/

/******************************************************************************
** Syntax : void _trap_0( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample Service for  class 0 trap                            **
**                                                                           **
*****************************************************************************/
/* Trap class 0 handler. */
void _trap_0( void )
{
  uint32 tin;
  uint32 CoreId = Mcal_GetCpuIndex();

  __asm ("svlcx");

  __GETTIN (tin);

  TrapIdentification[0][tin] = 1;
  switch(tin)
   {
     case 0:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);
            print_f("\nClass 0: Virtual Address Fill Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 1:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);
            print_f("\nClass 0: Virtual Address Protection Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
   }
  __asm ("rslcx \n");
  __asm ("rfe \n");
}
/******************************************************************************
** Syntax : void _trap_1( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 1 trap                            **
**                                                                           **
*****************************************************************************/
/* Trap class 1 handler. */
void _trap_1( void )
{
  uint32 tin;
  uint32 CoreId = Mcal_GetCpuIndex();
  __asm ("svlcx");

  __GETTIN (tin);

  TrapIdentification[1][tin] = 1;
  switch(tin)
   {
     case 1:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 1: Privilege Instruction Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

