liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC39B/0_Src/AppSw/Tricore/DemoMcal/Demo_Irq/Traps/Traps.c
     case 2:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 1: Memory Protection Read Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 3:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 1: Memory Protection Write Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 4:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 1: Memory Protection Execution Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 5:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 1: Memory Protection Peripheral Access Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 6:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 1: Memory Protection Null Address Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 7:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 1: Global Register Write Protection Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
   }
  __asm ("rslcx\n");
  __asm ("rfe \n");
}
/******************************************************************************
** Syntax : void _trap_2( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 2 trap                            **
**                                                                           **
*****************************************************************************/
/* Trap class 2 handler. */
void _trap_2( void )
{
  uint32 tin;
  uint32 CoreId = Mcal_GetCpuIndex();

  __asm ("svlcx");

  __GETTIN (tin);

  TrapIdentification[2][tin] = 1;
  switch(tin)
   {
     case 1:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 2: Illegal Opcode Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 2:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 2: Unimplemented Opcode Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 3:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 2: Invalid Operand Specification Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 4:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 2: Data Address Alignment Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     case 5:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 2: Invalid Local Memory Address Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
   }
  __asm ("rslcx \n");
  __asm ("rfe \n");
}
/******************************************************************************
** Syntax : void _trap_3( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 3 trap                            **
**                                                                           **
*****************************************************************************/

/* Trap class 3 handler. */
void _trap_3( void )
{
  /* No local variables used in this function */
  /* No function calls to be performed */
  uint32 tin;
  uint32 CoreId = Mcal_GetCpuIndex();

  __asm ("svlcx");

  __GETTIN (tin);

  TrapIdentification[3][tin] = 1;

  UVALCON0  = (uint32) SCU_WDTCPU0_CON0.U;
  SCU_WDTCPU0_CON0.U = SCU_WDTCPU0_CON0.U & ~0x00000001 ;

