liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC39B/0_Src/AppSw/Tricore/DemoMcal/Demo_Irq/Traps/Traps.c
     case 2:
            Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
            print_f("\nCoreId = %d\n", CoreId);   
            print_f("\nClass 5: Sticky Arithmetic Overflow Trap occurred\n");
            Mcal_ReleaseSpinlock(&Trap_lock);
            get_char();
          break;

     default:
          /* Halt the execution if debug mode enabled.*/
          DEBUG();
          break;
   }
  __asm ("rslcx \n");
  __asm ("rfe \n");
}

/******************************************************************************
** Syntax : void _trap_6( void )                                             **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       reentrant                                               **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description : Sample handler for  class 6 trap                            **
**                                                                           **
*****************************************************************************/

/* *INDENT-OFF* */


/* Trap class 6 handler. */
void _trap_6( void )
{
    uint32 CoreId = Mcal_GetCpuIndex();
    uint8 tin;
  __asm ("svlcx");

  __GETTIN (tin);

  /* TIN can be any number between 0 and 255.
   * storing the tin number in
   * TrapIdentification[6][0]
   */
  TrapIdentification[6][0] = tin;

  if ((MCAL_TIN_CALL_WRITE32 == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR=NULL;
    uint32 Value=0;

    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
      __asm("mov %0,d5" : "=d"(Value));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
      __asm__("mov %0,%%d5" : "=d"(Value));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      GET_DATA_REG(d5,Value);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    *SFR = Value;
  }
  else if ((MCAL_CALL_TIN_WRITE_PERIP_ENDINIT == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR=NULL;
    uint32 Value=0;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
      __asm("mov %0,d4" : "=d"(Value));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
      __asm__("mov %0,%%d4" : "=d"(Value));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      GET_DATA_REG(d4,Value);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    Mcal_WritePeripEndInitProtReg(SFR, Value);
  }
  else if ((MCAL_CALL_TIN_WRITE_SAFETY_ENDINIT == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR=NULL;
    uint32 Value=0;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
      __asm("mov %0,d4" : "=d"(Value));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
      __asm__("mov %0,%%d4" : "=d"(Value));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      GET_DATA_REG(d4,Value);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    Mcal_WriteSafetyEndInitProtReg(SFR, Value);
  }
  else if ((MCAL_CALL_TIN_WRITE_SAFETY_ENDINIT_MASK == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR=NULL;
    uint32 Value=0;
    uint32 Mask=0;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
      __asm("mov %0,d4" : "=d"(Value));
      __asm("mov %0,d5" : "=d"(Mask));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
      __asm__("mov %0,%%d4" : "=d"(Value));
      __asm__("mov %0,%%d5" : "=d"(Mask));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      GET_DATA_REG(d4,Value);
      GET_DATA_REG(d5,Mask);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    Mcal_WriteSafetyEndInitProtRegMask(SFR, Value, Mask);
  }
  else if ((MCAL_CALL_TIN_WRITE_CPU_ENDINIT == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR=NULL;
    uint32 Value=0;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
      __asm("mov %0,d4" : "=d"(Value));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
      __asm__("mov %0,%%d4" : "=d"(Value));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      GET_DATA_REG(d4,Value);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    Mcal_WriteCpuEndInitProtReg(SFR, Value);
  }
  else  if ((MCAL_TIN_CALL_MODIFY32 == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR=NULL;
    uint32 SetMask=0;
    uint32 ClearMask=0;
    uint32 Value=0;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
      __asm("mov %0,d5" : "=d"(ClearMask));
      __asm("mov %0,d6" : "=d"(SetMask));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
      __asm__("mov %0,%%d5" : "=d"(ClearMask));
      __asm__("mov %0,%%d6" : "=d"(SetMask));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      GET_DATA_REG(d5,ClearMask);
      GET_DATA_REG(d6,SetMask);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    Value = ((*SFR)& (ClearMask));
    *SFR = ((Value)|(SetMask));
  }
  else  if ((MCAL_TIN_CALL_READ32 == tin))
  {
    #if defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
    uint32 TempAddress;
    #endif
    #endif
    uint32 *SFR=NULL;
    #ifdef _TASKING_C_TRICORE_
    #if (_TASKING_C_TRICORE_ == 1U)
      __asm("mov.aa %0,a4" : "=a"(SFR));
    #endif
    #elif defined _GNU_C_TRICORE_
    #if (_GNU_C_TRICORE_ == 1U)
      __asm__("mov.aa %0,%%a4" : "=a"(SFR));
    #endif
    #elif defined _DIABDATA_C_TRICORE_
    #if (_DIABDATA_C_TRICORE_ == 1U)
      GET_ADDRESS_REG(a4,TempAddress);
      SFR = (uint32 * )TempAddress;
    #endif
    #endif
    SFR_Return_Value = *SFR;
  }
   else if ((MCAL_CALL_TIN_SET_BIT_ATOMIC == tin))
  {
    volatile sint32* DataPtr =NULL;
    volatile uint32 Data=0;
    volatile sint32 BitPos=0;
    volatile uint32 BitLen=0;
#ifdef _TASKING_C_TRICORE_
#if (_TASKING_C_TRICORE_ == 1)
      __asm("mov.aa %0,a4" : "=a"(DataPtr));
      __asm("mov %0,d6" : "=d"(Data));
      __asm("mov %0,d4" : "=d"(BitPos));
      __asm("mov %0,d5" : "=d"(BitLen));
#endif /* #if (_TASKING_C_TRICORE_ == 1U) */
#elif defined _GNU_C_TRICORE_
#if (_GNU_C_TRICORE_ == 1U)
      __asm("mov.aa %0,%%a4" : "=a"(DataPtr));
      __asm("mov %0,%%d6" : "=d"(Data));
      __asm("mov %0,%%d4" : "=d"(BitPos));
      __asm("mov %0,%%d5" : "=d"(BitLen));
#endif /* #if (_GNU_C_TRICORE_ == 1U) */
#elif defined _DIABDATA_C_TRICORE_
#if (_DIABDATA_C_TRICORE_ == 1U)
      uint32 tempaddress;
      GET_ADDRESS_REG(a4,tempaddress);
      DataPtr= (sint32*)tempaddress;
      GET_DATA_REG(d6,Data);
      GET_DATA_REG(d4,BitPos);
      GET_DATA_REG(d5,BitLen);
#endif /* #if (_DIABDATA_C_TRICORE_ == 1U) */
#endif
  switch(BitLen)
   {
     case 1:
       IMASKLDMST((sint32*)(void*)(DataPtr),(Data),(BitPos),1);
      break;
     case 2:
       IMASKLDMST((sint32*)(void*)(DataPtr),(Data),(BitPos),2);
      break;      
     case 3:
       IMASKLDMST((sint32*)(void*)(DataPtr),(Data),(BitPos),3);
      break;    
      case 4:
       IMASKLDMST((sint32*)(void*)(DataPtr),(Data),(BitPos),4);
      break;  
     case 8:
       IMASKLDMST((sint32*)(void*)(DataPtr),(Data),(BitPos),8);
      break;
     case 12:
       IMASKLDMST((sint32*)(void*)(DataPtr),(Data),(BitPos),12);
      break;      
     case 16:
       IMASKLDMST((sint32*)(void*)(DataPtr),(Data),(BitPos),16);
      break; 
     default:
     break;
   }     
  }
  else
  {
    Mcal_GetSpinlock(&Trap_lock,CPU_SPINLOCK_TIMEOUT_TRAP);
    print_f("\nCoreId = %d\n", CoreId);   
    print_f("\nClass 6: System Call Trap occurred\n");
    Mcal_ReleaseSpinlock(&Trap_lock);
    get_char();
  }

  __asm ("rslcx \n");
  __asm ("rfe \n");
}

